Revit 2027 API
FlowPositionCharacteristic Enumeration
 The flow position characteristic of the analytical segment cluster.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FlowPositionCharacteristic
Public Enumeration FlowPositionCharacteristic
public enum class FlowPositionCharacteristic
type FlowPositionCharacteristic
Members
Member name | Value | Description
Branch | 2 |  The segment is in the branch direction.
Bullhead | 4 |  The segment is in the bullhead straight direction where multiple flow paths are combined into the branch segment.
BullheadCombined | 5 |  The segment is in the bullhead branch direction with combined flow paths.
Combined | 3 |  The segment flow is combined from multiple other segments.
Straight | 1 |  The segment is in the straight direction.
Undefined | 0 |  The flow position characteristic is undefined.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace